'''Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».

Для какого наибольшего натурального числа А формула

¬ДЕЛ(x, А) → (ДЕЛ(x, 6) → ¬ДЕЛ(x, 4))

тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?'''

for a in range (1,100):
  m =[]
  for x in range (1,100):
   f = (( not (x%a ==0)) <= ((x % 6 == 0) <= (not (x%4==0))))
   m.append (f)
  if m.count (False) ==0:
    print (a)
    
#     f = (( not (x%a ==0)) <= ((x % 6 == 0) <= (not (x%4==0)))
#         ^
# SyntaxError: '(' was never closed